pulp-bio/wulpus/fw/msp430/wulpus_msp430_firmware/driverlib/MSP430FR5xx_6xx/saph_a.h
//*****************************************************************************
//
// saph_a.h - Driver for the SAPH_A Module.
//
//*****************************************************************************

#ifndef __MSP430WARE_SAPH_A_H__
#define __MSP430WARE_SAPH_A_H__

#include "inc/hw_memmap.h"

#ifdef __MSP430_HAS_SAPH_A__

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
// The following value specifies how many configurable channels in physcial
// interface.
//
//*****************************************************************************
#define SAPH_A_PHY_CHANNEL_COUNT                                                2

typedef struct _phy_param {
    //! Is the physical output channel to configure.
    //! \n Valid values are:
    //! - \b SAPH_A_PHY_CHANNEL_1
    //! - \b SAPH_A_PHY_CHANNEL_2
    uint16_t channel;
    //! Is the channel output value.
    //! \n Valid values are:
    //! - \b SAPH_A_PHY_OUTPUT_HIGH 
    //! - \b SAPH_A_PHY_OUTPUT_LOW [Default]
    uint16_t outputValue;
    //! Is the channel output enable.
    //! \n Valid values are:
    //! - \b SAPH_A_PHY_OUTPUT_ENABLE 
    //! - \b SAPH_A_PHY_OUTPUT_DISABLE [Default]
    uint16_t enableOutput;
    //! Is the channel output full pull enable.
    //! \n Valid values are:
    //! - \b SAPH_A_PHY_FULLPULL_ENABLE 
    //! - \b SAPH_A_PHY_FULLPULL_DISABLE [Default]
    uint16_t enableFullPull;
    //! Is the channel output termination enable.
    //! \n Valid values are:
    //! - \b SAPH_A_PHY_TERMINATION_ENABLE 
    //! - \b SAPH_A_PHY_TERMINATION_DISABLE [Default]
    uint16_t enableTermination;
    //! Is the channel output functional select.
    //! \n Valid values are:
    //! - \b SAPH_A_PHY_OUTPUT_GENERAL_PURPOSE [Default]
    //! - \b SAPH_A_PHY_OUTPUT_PULSEGENERATOR_SINGLE_DRIVE
    //! - \b SAPH_A_PHY_OUTPUT_PULSEGENERATOR_DIFFERENTIAL_DRIVE
    uint16_t outputFunction;
    //! Is the channel pull up trim pattern.
    uint16_t pullUpTrim;
    //! Is the channel pull down trim pattern.
    uint16_t pullDownTrim;
    //! Is the channel termination trim pattern.
    uint16_t terminationTrim;
} SAPH_A_configPHYParam;

typedef struct _phy_bias {
    //! Selects the channel for excitation bias switch.
    //! \n Valid values are:
    //! - \b SAPH_A_PHY_BIAS_SWITCH_OPEN [Default]
    //! - \b SAPH_A_PHY_BIAS_SWITCH_CLOSED 
    uint16_t biasSwitch[SAPH_A_PHY_CHANNEL_COUNT];
    //! Selects PGA bias.
    //! \n Valid values are:
    //! - \b SAPH_A_PHY_PGA_BIAS_GROUNDED 
    //! - \b SAPH_A_PHY_PGA_BIAS_LOW_VALUE
    //! - \b SAPH_A_PHY_PGA_BIAS_NOMINAL_VALUE
    //! - \b SAPH_A_PHY_PGA_BIAS_HIGH_VALUE
    uint16_t biasPGA;
    //! Selects excitation bias.
    //! \n Valid values are:
    //! - \b SAPH_A_PHY_EXCITATION_BIAS_GROUNDED
    //! - \b SAPH_A_PHY_EXCITATION_BIAS_LOW_VALUE
    //! - \b SAPH_A_PHY_EXCITATION_BIAS_NOMINAL_VALUE
    //! - \b SAPH_A_PHY_EXCITATION_BIAS_HIGH_VALUE
    uint16_t biasExcitation;
    //! Enables charge pump during acquisition.
    //! \n Valid values are:
    //! - \b SAPH_A_PHY_MULTIPLEXER_CHARGEPUMP_ENABLE
    //! - \b SAPH_A_PHY_MULTIPLEXER_CHARGEPUMP_DISABLE
    uint16_t enableChargePump;
    //! Enables line input leakage compensation.
    //! \n Valid values are:
    //! - \b SAPH_A_PHY_LEAKAGE_COMPENSATION_ENABLE
    //! - \b SAPH_A_PHY_LEAKAGE_COMPENSATION_DISABLE
    uint16_t enableLeakageCompensation;
    //! Selects PGA bias switch open or closed.
    //! \n Valid values are:
    //! - \b SAPH_A_PHY_PGA_BIAS_SWITCH_OPEN
    //! - \b SAPH_A_PHY_PGA_BIAS_SWITCH_CLOSED
    uint16_t biasSwitchPGA;
    //! Select ASQ bias switch control.
    //! \n Valid values are:
    //! - \b SAPH_A_PHY_BIAS_SWITCH_CONTROLLED_BY_REGISTER
    //! - \b SAPH_A_PHY_BIAS_SWITCH_CONTROLLED_BY_ASQ
    uint16_t biasSwitchASQ;
} SAPH_A_configPHYBiasParam;

typedef struct _ppg_count
{
    //! Selects high impedance input.
    //! \n Valid values are:
    //! - \b SAPH_A_PPG_HIGH_IMPEDANCE_ON_PAUSE_OUTPUTDRIVE
    //! - \b SAPH_A_PPG_HIGH_IMPEDANCE_ON_PAUSE_PLEV
    uint16_t highImpedance;
    //! Sets the pause level high or low.
    //! \n Valid values are:
    //! - \b SAPH_A_PPG_PAUSE_LEVEL_LOW
    //! - \b SAPH_A_PPG_PAUSE_LEVEL_HIGH
    uint16_t pauseLevel;
    //! Sets the pause polarity high or low.
    //! \n Valid values are:
    //! - \b SAPH_A_PPG_PAUSE_POLARITY_HIGH
    //! - \b SAPH_A_PPG_PAUSE_POLARITY_LOW
    uint16_t pausePolarity;
    //! Sets the stop pulse count.
    uint16_t stopPauseCount;
    //! Sets the excitation pulse count.
    uint16_t excitationPulseCount;
} SAPH_A_configPPGCountParam;

typedef struct _ppg_config
{
    //! Enables PPG prescaler.
    //! \n Valid values are:
    //! - \b SAPH_A_PPG_PRESCALER_ENABLE
    //! - \b SAPH_A_PPG_PRESCALER_DISABLE
    uint16_t enablePrescaler;
    //! Selects PPG trigger source.
    //! \n Valid values are:
    //! - \b SAPH_A_PPG_TRIGGER_SOURCE_SOFTWARE
    //! - \b SAPH_A_PPG_TRIGGER_SOURCE_ASQ
    //! - \b SAPH_A_PPG_TRIGGER_SOURCE_TIMER
    uint16_t triggerSource;
    //! Selects PPG channel.
    //! \n Valid values are:
    //! - \b SAPH_A_PPG_CHANNEL_0
    //! - \b SAPH_A_PPG_CHANNEL_1
    uint16_t channelSelect;
    //! Selects PPG or ASEQ in charge of PHY port.
    //! \n Valid values are:
    //! - \b SAPH_A_PPG_PORT_CHARGED_BY_PPG
    //! - \b SAPH_A_PPG_PORT_CHARGED_BY_ASEQ
    uint16_t portSelect;
} SAPH_A_configPPGParam;

typedef struct _asq_config
{
    //! Enables ASQ abort on errors if the conversion result is outside of expected
    //! value or an overflow/underflow condition occured.
    //! \n Valid values are:
    //! - \b SAPH_A_ASQ_ABORT_ON_ERROR_ENABLE
    //! - \b SAPH_A_ASQ_ABORT_ON_ERROR_DISABLE
    uint16_t abortOnError;
    //! Selects ASQ trigger source.
    //! \n Valid values are:
    //! - \b SAPH_A_ASQ_TRIGGER_SOURCE_SOFTWARE
    //! - \b SAPH_A_ASQ_TRIGGER_SOURCE_P_SEQUENCER
    //! - \b SAPH_A_ASQ_TRIGGER_SOURCE_TIMER
    uint16_t triggerSource;
    //! Selects ASQ channel.
    //! \n Valid values are:
    //! - \b SAPH_A_ASQ_CHANNEL_0
    //! - \b SAPH_A_ASQ_CHANNEL_1
    uint16_t channelSelect;
    //! Selects pwn channel or opposite side channel to receive.
    //! \n Valid values are:
    //! - \b SAPH_A_ASQ_IDENTICAL_CHANNEL
    //! - \b SAPH_A_ASQ_DIFFERENT_CHANNEL
    uint16_t sideOfChannel;
    //! Selects standby indication.
    //! \n Valid values are:
    //! - \b SAPH_A_ASQ_STANDBY_INDICATION_POWEROFF
    //! - \b SAPH_A_ASQ_STANDBY_INDICATION_STANDBY
    uint16_t standByIndication;
    //! Requests OFF in the end of sequence.
    //! \n Valid values are:
    //! - \b SAPH_A_ASQ_END_OF_SEQUENCE_OFF_DISABLE
    //! - \b SAPH_A_ASQ_END_OF_SEQUENCE_OFF_ENABLE
    uint16_t endOfSequence;
    //! Selects early receive bias generating source.
    //! \n Valid values are:
    //! - \b SAPH_A_ASQ_EARLY_RECEIVE_BIAS_BY_TIMEMARK_C
    //! - \b SAPH_A_ASQ_EARLY_RECEIVE_BIAS_BY_TIMEMARK_A
    uint16_t earlyReceiveBias;
    //! Enables channel toggle.
    //! \n Valid values are:
    //! - \b SAPH_A_ASQ_TOGGLE_CHANNEL_ENABLE
    //! - \b SAPH_A_ASQ_TOGGLE_CHANNEL_DISABLE
    uint16_t enableChannelToggle;
} SAPH_A_configASQParam;

