pulp-bio/wulpus/fw/msp430/wulpus_msp430_firmware/driverlib/MSP430FR5xx_6xx/saph_a.h
typedef struct _asq_ping_config
{
    //! Sets ASQ ping counter for polarity.
    uint16_t polarity;
    //! Sets ASQ ping counter for pause level.
    uint16_t pauseLevel;
    //! Sets ASQ ping counter for high impedance.
    uint16_t pauseHighImpedance;
} SAPH_A_configASQPingParam;

typedef struct _mcnf_config
{
    //! Enables/disables low power bias operation mode.
    //! \n Valid values are:
    //! - \b SAPH_A_LOW_POWER_BIAS_MODE_DISABLE [Default]
    //! - \b SAPH_A_LOW_POWER_BIAS_MODE_ENABLE
    uint16_t lowPowerBiasMode;
    //! Enables/disables charge pump of the input multiplexer.
    //! \n Valid values are:
    //! - \b SAPH_A_CHARGE_PUMP_ON_SDHS_ASQ_REQUESTS_ONLY [Default]
    //! - \b SAPH_A_CHARGE_PUMP_ON_ALWAYS
    uint16_t chargePump;
    //! Sets bias impedance for RxBias and TxBias.
    //! \n Valid values are:
    //! - \b SAPH_A_MCNF_500_OHMS_RXBIAS_450_OHMS_TXBIAS
    //! - \b SAPH_A_MCNF_900_OHMS_RXBIAS_850_OHMS_TXBIAS
    //! - \b SAPH_A_MCNF_1500_OHMS_RXBIAS_1450_OHMS_TXBIAS [Default]
    //! - \b SAPH_A_MCNF_2950_OHMS_RXBIAS_2900_OHMS_TXBIAS
    uint16_t biasImpedance;
} SAPH_A_configModeParam;

typedef struct _xpg_config
{
    //! Selects the type of event generated by dual tone loop mode.
    //! \n Valid values are:
    //! - \b SAPH_A_TIMER_COUNT_EVENT
    //! - \b SAPH_A_DMA_TRIGGER_EVENT
    uint16_t eventType;
    //! Selects extended mode type.
    //! \n Valid values are:
    //! - \b SAPH_A_SINGLE_TONE_GENERATION
    //! - \b SAPH_A_DUAL_TONE_GENERATION
    //! - \b SAPH_A_DUAL_TONE_LOOP
    uint16_t extendedMode;
    //! Selects count of extra excitation pulses excited.
    uint16_t extraPulses;
} SAPH_A_configXPGParam;

//*****************************************************************************
//
// The following are values that can be passed to the mask parameter for
// functions: SAPH_A_clearInterrupt(), SAPH_A_enableInterrupt(), and 
// SAPH_A_disableInterrupt() as well as returned by the 
// SAPH_A_getInterruptStatus() function.
//
//*****************************************************************************
#define SAPH_A_DATA_ERROR_INTERRUPT                                       DATAERR
#define SAPH_A_TIMEMARK_F_TIMEOUT_INTERRUPT                                 TMFTO
#define SAPH_A_ACQUISITION_SEQUENCER_DONE_INTERRUPT                         SEQDN
#define SAPH_A_PING_TRANSMIT_DONE_INTERRUPT                                 PNGDN

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePHY().
//
//*****************************************************************************
#define SAPH_A_PHY_CHANNEL_1                                                    0
#define SAPH_A_PHY_CHANNEL_2                                                    1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePHY().
//
//*****************************************************************************
#define SAPH_A_PHY_OUTPUT_HIGH                                           CH0OUT_1
#define SAPH_A_PHY_OUTPUT_LOW                                            CH0OUT_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePHY().
//
//*****************************************************************************
#define SAPH_A_PHY_OUTPUT_ENABLE                                          CH0OE_1
#define SAPH_A_PHY_OUTPUT_DISABLE                                         CH0OE_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePHY().
//
//*****************************************************************************
#define SAPH_A_PHY_FULLPULL_ENABLE                                        CH0FP_1
#define SAPH_A_PHY_FULLPULL_DISABLE                                       CH0FP_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePHY().
//
//*****************************************************************************
#define SAPH_A_PHY_TERMINATION_ENABLE                                   CH0TERM_1
#define SAPH_A_PHY_TERMINATION_DISABLE                                  CH0TERM_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePHY().
//
//*****************************************************************************
#define SAPH_A_PHY_OUTPUT_GENERAL_PURPOSE                               PCH0SEL_0
#define SAPH_A_PHY_OUTPUT_PULSEGENERATOR_SINGLE_DRIVE                   PCH0SEL_1
#define SAPH_A_PHY_OUTPUT_PULSEGENERATOR_DIFFERENTIAL_DRIVE             PCH0SEL_2

//*****************************************************************************
//
// The following are values that can be passed to the enableDummyLoad parameter
// for functions: SAPH_A_configurePHYMultiplexer().
//
//*****************************************************************************
#define SAPH_A_PHY_DUMMYLOAD_ENABLE                                       DUMEN_1
#define SAPH_A_PHY_DUMMYLOAD_DISABLE                                      DUMEN_0

//*****************************************************************************
//
// The following are values that can be passed to the sourceControl parameter
// for functions: SAPH_A_configurePHYMultiplexer().
//
//*****************************************************************************
#define SAPH_A_PHY_SOURCE_CONTROLLED_BY_REGISTER                         MUXCTL_0
#define SAPH_A_PHY_SOURCE_CONTROLLED_BY_ASQ                              MUXCTL_1

//*****************************************************************************
//
// The following are values that can be passed to the inputChannel parameter
// for functions: SAPH_A_configurePHYMultiplexer().
//
//*****************************************************************************
#define SAPH_A_PHY_INPUT_CHANNEL_0                                  MUXSEL__CH0IN
#define SAPH_A_PHY_INPUT_CHANNEL_1                                  MUXSEL__CH1IN

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePHYBias().
//
//*****************************************************************************
#define SAPH_A_PHY_BIAS_SWITCH_OPEN                                     CH0EBSW_0
#define SAPH_A_PHY_BIAS_SWITCH_CLOSED                                   CH0EBSW_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePHYBias().
//
//*****************************************************************************
#define SAPH_A_PHY_PGA_BIAS_GROUNDED                                    PGABIAS_0
#define SAPH_A_PHY_PGA_BIAS_LOW_VALUE                                   PGABIAS_1
#define SAPH_A_PHY_PGA_BIAS_NOMINAL_VALUE                               PGABIAS_2
#define SAPH_A_PHY_PGA_BIAS_HIGH_VALUE                                  PGABIAS_3

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePHYBias().
//
//*****************************************************************************
#define SAPH_A_PHY_EXCITATION_BIAS_GROUNDED                             EXCBIAS_0
#define SAPH_A_PHY_EXCITATION_BIAS_LOW_VALUE                            EXCBIAS_1
#define SAPH_A_PHY_EXCITATION_BIAS_NOMINAL_VALUE                        EXCBIAS_2
#define SAPH_A_PHY_EXCITATION_BIAS_HIGH_VALUE                           EXCBIAS_3

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePHYBias().
//
//*****************************************************************************
#define SAPH_A_PHY_MULTIPLEXER_CHARGEPUMP_ENABLE                           CPDA_1
#define SAPH_A_PHY_MULTIPLEXER_CHARGEPUMP_DISABLE                          CPDA_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePHYBias().
//
//*****************************************************************************
#define SAPH_A_PHY_LEAKAGE_COMPENSATION_ENABLE                             LILC_1
#define SAPH_A_PHY_LEAKAGE_COMPENSATION_DISABLE                            LILC_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePHYBias().
//
//*****************************************************************************
#define SAPH_A_PHY_PGA_BIAS_SWITCH_OPEN                                  PGABSW_0
#define SAPH_A_PHY_PGA_BIAS_SWITCH_CLOSED                                PGABSW_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePHYBias().
//
//*****************************************************************************
#define SAPH_A_PHY_BIAS_SWITCH_CONTROLLED_BY_REGISTER                    ASQBSC_0
#define SAPH_A_PHY_BIAS_SWITCH_CONTROLLED_BY_ASQ                         ASQBSC_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePPGCount().
//
//*****************************************************************************
#define SAPH_A_PPG_HIGH_IMPEDANCE_ON_PAUSE_HIGH                            PHIZ_1
#define SAPH_A_PPG_HIGH_IMPEDANCE_ON_PAUSE_LOW                             PHIZ_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePPGCount().
//
//*****************************************************************************
#define SAPH_A_PPG_PAUSE_LEVEL_HIGH                                        PLEV_1
#define SAPH_A_PPG_PAUSE_LEVEL_LOW                                         PLEV_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePPGCount().
//
//*****************************************************************************
#define SAPH_A_PPG_PAUSE_POLARITY_HIGH                                     PPOL_0
#define SAPH_A_PPG_PAUSE_POLARITY_LOW                                      PPOL_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePPG().
//
//*****************************************************************************
#define SAPH_A_PPG_PRESCALER_ENABLE                                       PSCEN_1
#define SAPH_A_PPG_PRESCALER_DISABLE                                      PSCEN_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePPG().
//
//*****************************************************************************
#define SAPH_A_PPG_TRIGGER_SOURCE_SOFTWARE                                TRSEL_0
#define SAPH_A_PPG_TRIGGER_SOURCE_ASQ                                     TRSEL_1
#define SAPH_A_PPG_TRIGGER_SOURCE_TIMER                                   TRSEL_2

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePPG().
//
//*****************************************************************************
#define SAPH_A_PPG_CHANNEL_0                                           PPGCHSEL_0
#define SAPH_A_PPG_CHANNEL_1                                           PPGCHSEL_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configurePPG().
//
//*****************************************************************************
#define SAPH_A_PPG_PORT_CHARGED_BY_PPG                                    PGSEL_0
#define SAPH_A_PPG_PORT_CHARGED_BY_ASEQ                                   PGSEL_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configureASQ().
//
//*****************************************************************************
#define SAPH_A_ASQ_ABORT_ON_ERROR_ENABLE                                 ERABRT_1
#define SAPH_A_ASQ_ABORT_ON_ERROR_DISABLE                                ERABRT_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configureASQ().
//
//*****************************************************************************
#define SAPH_A_ASQ_TRIGGER_SOURCE_SOFTWARE                        TRIGSEL__SWTRIG
#define SAPH_A_ASQ_TRIGGER_SOURCE_P_SEQUENCER                        TRIGSEL__PSQ
#define SAPH_A_ASQ_TRIGGER_SOURCE_TIMER                            TRIGSEL__TIMER

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configureASQ().
//
//*****************************************************************************
#define SAPH_A_ASQ_CHANNEL_0                                           ASQCHSEL_0
#define SAPH_A_ASQ_CHANNEL_1                                           ASQCHSEL_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configureASQ().
//
//*****************************************************************************
#define SAPH_A_ASQ_DIFFERENT_CHANNEL                                      CHOWN_0
#define SAPH_A_ASQ_IDENTICAL_CHANNEL                                      CHOWN_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configureASQ().
//
//*****************************************************************************
#define SAPH_A_ASQ_STANDBY_INDICATION_POWEROFF                      STDBY__PWROFF
#define SAPH_A_ASQ_STANDBY_INDICATION_STANDBY                        STDBY__STDBY

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configureASQ().
//
//*****************************************************************************
#define SAPH_A_ASQ_END_OF_SEQUENCE_OFF_DISABLE                            ESOFF_0
#define SAPH_A_ASQ_END_OF_SEQUENCE_OFF_ENABLE                             ESOFF_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configureASQ().
//
//*****************************************************************************
#define SAPH_A_ASQ_EARLY_RECEIVE_BIAS_BY_TIMEMARK_C                     EARLYRB_0
#define SAPH_A_ASQ_EARLY_RECEIVE_BIAS_BY_TIMEMARK_A                     EARLYRB_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configureASQ().
//
//*****************************************************************************
#define SAPH_A_ASQ_TOGGLE_CHANNEL_ENABLE                                  CHTOG_1
#define SAPH_A_ASQ_TOGGLE_CHANNEL_DISABLE                                 CHTOG_0

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configureMode().
//
//*****************************************************************************
#define SAPH_A_LOW_POWER_BIAS_MODE_DISABLE                                 LPBE_0
#define SAPH_A_LOW_POWER_BIAS_MODE_ENABLE                                LPBE_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configureMode().
//
//*****************************************************************************
#define SAPH_A_CHARGE_PUMP_ON_SDHS_ASQ_REQUESTS_ONLY                      CPEO_0
#define SAPH_A_CHARGE_PUMP_ON_ALWAYS                                      CPEO_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configureMode().
//
//*****************************************************************************
#define SAPH_A_MCNF_500_OHMS_RXBIAS_450_OHMS_TXBIAS                       BIMP_0
#define SAPH_A_MCNF_900_OHMS_RXBIAS_850_OHMS_TXBIAS                       BIMP_1
#define SAPH_A_MCNF_1500_OHMS_RXBIAS_1450_OHMS_TXBIAS                     BIMP_2
#define SAPH_A_MCNF_2950_OHMS_RXBIAS_2900_OHMS_TXBIAS                     BIMP_3

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configureExtendedPPG().
//
//*****************************************************************************
#define SAPH_A_TIMER_COUNT_EVENT                                        ETY_0
#define SAPH_A_DMA_TRIGGER_EVENT                                        ETY_1

//*****************************************************************************
//
// The following are values that can be passed to the config parameter for
// functions: SAPH_A_configureExtendedPPG().
//
//*****************************************************************************
#define SAPH_A_SINGLE_TONE_GENERATION                                   XMOD_0
#define SAPH_A_DUAL_TONE_GENERATION                                     XMOD_2
#define SAPH_A_DUAL_TONE_LOOP                                           XMOD_3

//*****************************************************************************
//
// The following are values that can be returned by the 
// SAPH_A_getPPGPhaseStatus() API
//
//*****************************************************************************
#define SAPH_A_PPG_STOP_PHASE                                           XSTAT_0
#define SAPH_A_PPG_PAUSE_PHASE                                          XSTAT_1
#define SAPH_A_PPG_REGULAR_EXCITATION_PHASE                             XSTAT_2
#define SAPH_A_PPG_EXTRA_EXCITATION_PHASE                               XSTAT_3

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************

//*****************************************************************************
//
//! \brief Unlocks certain SAPH_A registers.
//!
//! Unlock SAPH_A registers with offset address of 0xF or higher. IIDX, MIS, RIS,
//! IMSC, ICR, ISR, DESCLO, and DESCHI registers are not affected and the
//! registers are not locked. Utilize this function if those registers need to
//! be modified.
//! \n\b NOTE: Most of the SAPH_A APIs will not work unless SAPH_A is unlocked.
//!
//! \param baseAddress is the base address of the SAPH_A module.
//!
//! \return None
//
//*****************************************************************************
extern void SAPH_A_unlock(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Locks certain SAPH_A registers.
//!
//! Locks SAPH_A registers with offset address of 0xF or higher. IIDX, MIS, RIS,
//! IMSC, ICR, ISR, DESCLO, and DESCHI registers are not affected and the
//! registers are not locked. Utilize this function after SAPH_A_unlock()
//! after necessary registers have been modified.
//! SAPH_A registers, with the exception of the list in paragraph above, are
//! locked by default.
//!
//! \param baseAddress is the base address of the SAPH_A module.
//!
//! \return None
//
//*****************************************************************************
extern void SAPH_A_lock(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Clears SAPH_A interrupts.
//!
//! The SAPH_A interrupt source is cleared, so that it no longer asserts. If the
//! interrupt is not enabled, the corresponding bit in the RIS register bit will
//! be cleared. If the interrupt is enabled, the corresponding bit both MIS and 
//! RIS registers will be both cleared.
//!
//! \param baseAddress is the base address of the SAPH_A module.
//! \param mask is the logical OR of any of the following:
//!        - \b SAPH_A_DATA_ERROR_INTERRUPT - SAPH_A data error interrupt
//!        - \b SAPH_A_TIMEMARK_F_TIMEOUT_INTERRUPT - SAPH_A TMF time out interrupt
//!        - \b SAPH_A_ACQUISITION_SEQUENCER_DONE_INTERRUPT - SAPH_A acquistion sequencer done interrupt
//!        - \b SAPH_A_PING_TRANSMIT_DONE_INTERRUPT - SAPH_A ping transmit done interrupt
//!
//! \return None
//
//*****************************************************************************
extern void SAPH_A_clearInterrupt(uint16_t baseAddress, uint8_t mask);

//*****************************************************************************
//
//! \brief Enables SAPH_A interrupts.
//!
//! Enables the indicated SAPH_A interrupt sources.  Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor. <b>Does not clear interrupt flags.</b>
//!
//! \param baseAddress is the base address of the SAPH_A module.
//! \param mask is the logical OR of any of the following:
//!        - \b SAPH_A_DATA_ERROR_INTERRUPT - SAPH_A data error interrupt
//!        - \b SAPH_A_TIMEMARK_F_TIMEOUT_INTERRUPT - SAPH_A TMF time out interrupt
//!        - \b SAPH_A_ACQUISITION_SEQUENCER_DONE_INTERRUPT - SAPH_A acquistion sequencer done interrupt
//!        - \b SAPH_A_PING_TRANSMIT_DONE_INTERRUPT - SAPH_A ping transmit done interrupt
//!
//! \return None
//
//*****************************************************************************
extern void SAPH_A_enableInterrupt(uint16_t baseAddress, uint8_t mask);

